test/fixtures/files/subscription_canceled.json

{
  "id": "sub_ESCEnrgGdl9Z18",
  "object": "subscription",
  "application_fee_percent": null,
  "billing": "charge_automatically",
  "billing_cycle_anchor": 1554390000,
  "billing_thresholds": null,
  "cancel_at": 1551797999,
  "cancel_at_period_end": true,
  "canceled_at": 1549092286,
  "created": 1549088341,
  "current_period_end": 1551797999,
  "current_period_start": 1549088341,
  "customer": "cus_ESCEwmXhpJdfnC",
  "days_until_due": null,
  "default_source": null,
  "discount": null,
  "ended_at": null,
  "items": {
    "object": "list",
    "data": [
      {
        "id": "si_ESCEDxGkTBMpmv",
        "object": "subscription_item",
        "billing_thresholds": null,
        "created": 1549088342,
        "metadata": {
        },
        "plan": {
          "id": "plan_EQjv185SooNzUa",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 350,
          "billing_scheme": "per_unit",
          "created": 1548752380,
          "currency": "jpy",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {
          },
          "nickname": "ブンゴウメールPRO",
          "product": "prod_EQju7h2aOakmVF",
          "tiers": null,
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "quantity": 1,
        "subscription": "sub_ESCEnrgGdl9Z18"
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/subscription_items?subscription=sub_ESCEnrgGdl9Z18"
  },
  "livemode": false,
  "metadata": {
  },
  "plan": {
    "id": "plan_EQjv185SooNzUa",
    "object": "plan",
    "active": true,
    "aggregate_usage": null,
    "amount": 350,
    "billing_scheme": "per_unit",
    "created": 1548752380,
    "currency": "jpy",
    "interval": "month",
    "interval_count": 1,
    "livemode": false,
    "metadata": {
    },
    "nickname": "ブンゴウメールPRO",
    "product": "prod_EQju7h2aOakmVF",
    "tiers": null,
    "tiers_mode": null,
    "transform_usage": null,
    "trial_period_days": null,
    "usage_type": "licensed"
  },
  "quantity": 1,
  "schedule": null,
  "start": 1549092286,
  "status": "trialing",
  "tax_percent": null,
  "trial_end": 1551797999,
  "trial_start": 1549088341
}
