test/fixtures/files/subscription_deleted.json

{
  "id": "sub_ESujpjoOD42eBY",
  "object": "subscription",
  "application_fee_percent": null,
  "billing": "charge_automatically",
  "billing_cycle_anchor": 1549253931,
  "billing_thresholds": null,
  "cancel_at": 1549253931,
  "cancel_at_period_end": true,
  "canceled_at": 1549253907,
  "created": 1549253871,
  "current_period_end": 1549253931,
  "current_period_start": 1549253871,
  "customer": "cus_ESczwJ9gMff3Qj",
  "days_until_due": null,
  "default_source": null,
  "discount": null,
  "ended_at": 1549253946,
  "items": {
    "object": "list",
    "data": [
      {
        "id": "si_ESujb8rSIyGDQX",
        "object": "subscription_item",
        "billing_thresholds": null,
        "created": 1549253871,
        "metadata": {
        },
        "plan": {
          "id": "plan_EQjv185SooNzUa",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 350,
          "billing_scheme": "per_unit",
          "created": 1548752380,
          "currency": "jpy",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {
          },
          "nickname": "ブンゴウメールPRO",
          "product": "prod_EQju7h2aOakmVF",
          "tiers": null,
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "quantity": 1,
        "subscription": "sub_ESujpjoOD42eBY"
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/subscription_items?subscription=sub_ESujpjoOD42eBY"
  },
  "livemode": false,
  "metadata": {
  },
  "plan": {
    "id": "plan_EQjv185SooNzUa",
    "object": "plan",
    "active": true,
    "aggregate_usage": null,
    "amount": 350,
    "billing_scheme": "per_unit",
    "created": 1548752380,
    "currency": "jpy",
    "interval": "month",
    "interval_count": 1,
    "livemode": false,
    "metadata": {
    },
    "nickname": "ブンゴウメールPRO",
    "product": "prod_EQju7h2aOakmVF",
    "tiers": null,
    "tiers_mode": null,
    "transform_usage": null,
    "trial_period_days": null,
    "usage_type": "licensed"
  },
  "quantity": 1,
  "schedule": null,
  "start": 1549253907,
  "status": "canceled",
  "tax_percent": null,
  "trial_end": 1549253931,
  "trial_start": 1549253871
}
